########################################################################
# 정확도가 가장 높은 앙상블 부스팅 모형으로 전체 예측
########################################################################

getwd()
load('../../3. DeepD_데이터 및 모델세이브파일/r_data/r_input.RData')
load('../../3. DeepD_데이터 및 모델세이브파일/r_model/boosting_md.RData')
all_pred<-predict(boo.fit, newdata = df3)
#save(all_pred, file="../../3. DeepD_데이터 및 모델세이브파일/r_data/r_output.RData")
prob<-all_pred$prob
prob<-as.data.frame(prob[,2])
t_df<-cbind(cu,df3[,7], prob)
colnames(t_df)<-c('cust','realorder','prob')


########################################################################
####분포확인
########################################################################
cut_value <- cut(t_df$prob, breaks= 10) #계급:10개
table(cut_value)
#실제재구매율 확인
table(t_df[t_df$prob<=0.376&t_df$prob>0.301,2])


########################################################################
####타겟 추출
########################################################################
#0.301~0.899
library(dplyr)
t_df<-arrange(t_df, prob)
target<-t_df[1775:11860,]
target<-unique(target$cust)
#총 10,086명

########################################################################
####타겟고객의 구매이력 데이터 추출
########################################################################
#load("../../3. DeepD_데이터 및 모델세이브파일/r_data/주류구매데이터.RData")
data<-drink[drink$cust %in% target,] #89,219건
write.csv(data, "data.csv")